Repository: yamato/perl6doc-jp
Catalog: tm/auto/S02-bits-20140914.tmx
Source language: en_us
Languages: ja

source: Using the :exists adverb together with a list slice results in in a Parcel of Bool, which you could also put in a junction with similar semantics:
ja: スライスがBoolのParcelで結果としてなるリストと共に:exists副詞を使用すること、それをあなたは類似した意味論で交差点に置くこともできた：

source: although with different optimization options for the compiler.
ja: コンパイラのために異なる最適化オプションであるが。

source: You may use :!exists to test for non-existence.
ja: あなたは、不存在に対する検査に、:!existsを使うかもしれない。

source: This is specifically handy because of precedence rules making !%hash&lt;a:exists&gt; apply the :exists to the prefix !.
ja: これは、!%hash&lt;a：存在＞を:existsを接頭辞!に適用させている優先順位規則のため、特に便利である。

source: %hash&lt;a:!exists&gt; does not have that problem.
ja: %hash&lt;a：存在＞には、その問題がない。

source: Combining subscript adverbs
ja: 下に書いた副詞を結合すること

source: Like named parameters in a call, there is no order in handling multiple adverbs with subscripts.
ja: 呼び出しの挙げられたパラメータのように、順序が、添え字で複数の副詞を取り扱う際にない。

source: Some combinations make sense, such as:
ja: 例えば、若干の組合せは意味をなす：

source: would slice out pairs for the given the keys out of one hash into another.
ja: 1の中の鍵がもう一つにハッシュする既知の事実のために、一組を外にスライスさせる。

source: would return the keys that were actually deleted from the hash.
ja: 実はハッシュから削除されたキーを返る。

source: The adverbs that specify a return type only, can not be combined, because combinations such as :
ja: 戻り型だけを指定して、結合されることができない副詞例えば組合せ：

source: kv:p or :
ja: kv：p、または：

source: v:k simply do not make sense.
ja: v：kは、単に意味をなさない。

source: These combinations are considered legal and mean the following:
ja: これらの組合せは合法的であると考えられて、以下を意味する：

source: An implementation is free to silently ignore any other combinations or silently prefer one of the adverbs given above any other.
ja: 実装は、黙って他のどの組合せも無視するか、黙って、他のものより上に伝えられる副詞の1つを好むことができる。

source: Numeric and boolean context of hashes
ja: ハッシュの数字とブール値コンテキスト

source: In numeric context (i.e. when cast into Int or Num), a Hash object becomes the number of pairs contained in the hash.
ja: 数値コンテキスト（すなわちIntまたはNumへ投げられるとき）では、Hashオブジェクトは、ハッシュに含まれる組の数になる。

source: In a boolean context, a Hash object is true if there are any pairs in the hash.
ja: ブール値コンテキストでは、何か組がハッシュであるならば、ハッシュオブジェクトは真実である。

source: List sorting
ja: リストソーティング

source: Sorting a list of pairs should sort on their keys by default, then on their values.
ja: 組のリストがデフォルトによる彼らのキーの上で、それから彼らの値の上でソートしなければならないソート。

source: Sorting a list of lists should sort on the first elements, then the second elements, etc. For more on sort see S29.
ja: リストのリストをソートすることは最初の上で要素をソートしなければならない、そして、第2の要素、sortの上のより多くのためのその他はS29を見る。

source: Special variables
ja: 特殊変数

source: Many of the special variables of Perl 5 are going away.
ja: Perl 5の特殊変数の多くは、去っている。

source: Those that apply to some object such as a filehandle will instead be attributes of the appropriate object.
ja: ファイルハンドルのような若干のオブジェクトにあてはまるものは、その代わりに適切なオブジェクトの属性である。

source: Those that are truly global will have global alphabetic names, such as $*PID or @*ARGS.
ja: 本当に全世界であるものには、世界的なアルファベットの名前（例えば$*PIDまたは@*ARGS）がある。

source: Any remaining special variables will be lexically scoped.
ja: 特殊変数のままになっている何でも、辞書的に捜し出される。

source: This includes $_ and @_, as well as the new $/, which is the return value of the last regex match.
ja: これは$_と@_（新しい$/だけでなく）を含む。そして、それは最後の正規表現マッチの戻り値である。

source: $0, $1, $2, etc., are aliases into the $/ object.
ja: $0、$1、$2、その他は、$/オブジェクトへの別名である。

source: Array end index
ja: 配列端部インデックス

source: The $#foo notation is dead.
ja: $#foo表記法は死んでいる。

source: Use @foo.end or @foo[*-1] instead.
ja: その代わりに@foo.endまたは@foo[*-1]を使いなさい。

source: (Or @foo.shape[$dimension] for multidimensional arrays.)
ja: （または多次元配列のための@foo.shape[$dimension]。）

source: Names
ja: 名前

source: An identifier is composed of an alphabetic character followed by any sequence of alphanumeric characters.
ja: 識別子は、英数字の何か連作が続く英字から成る。

source: The definitions of alphabetic and numeric include appropriate Unicode characters.
ja: アルファベットのものの定義と数字は、適正ユニコード文字を含む。

source: Underscore is always considered alphabetic.
ja: アンダーラインは、常に考えられるアルファベットの。

source: An identifier may also contain isolated apostrophes or hyphens provided the next character is alphabetic.
ja: 識別子は、文字がそうである次を提供される孤立したアポストロフィまたはハイフンも含むかもしれないアルファベットの。

source: A name is anything that is a legal part of a variable name (not counting the sigil).
ja: 名前は、変数名（シギルを数えない）の法律部分である何でもある。

source: This includes
ja: これが、含む

source: When not used as a sigil, the semantic function of :: within a name is to force the preceding portion of the name to be considered a package through which the subsequent portion of the name is to be located.
ja: シギルとして使われないとき、名前の範囲内の::の意味関数は名前の前の部分に名前の以降の部分が位置することであるパッケージと考えられることを強いることである。

source: If the preceding portion is null, it means the package is unspecified and must be searched for according to the nature of what follows.
ja: 前の部分が無効であるならば、それはパッケージが明らかでなくて、あとに続くことの性質に一致することを求めて捜されなければならないことを意味する。

source: Generally this means that an initial :: following the main sigil is a no-op on names that are known at compile time, though ::() can also be used to introduce an interpolation (see below).
ja: ::()が改竄者（下記参照）を紹介するのに用いられることもできるけれども、通常、これは、主なシギルの後の最初の::がコンパイル時で知られている名前に関するノーオペレーションであることを意味する。

source: Also, in the absence of another sigil, :: can serve as its own sigil indicating intentional use of a not-yet-declared package name.
ja: また、もう一つのシギルがない場合、::は、意図的な使用を示しているそれ自身のシギルとして、取り扱うことができるnot-yet-declaredしたパッケージ名。

source: Unlike in Perl 5, if a sigil is followed by comma, semicolon, a colon not followed by an identifier, or any kind of bracket or whitespace (including Unicode brackets and whitespace), it will be taken to be a sigil without a name rather than a punctuational variable.
ja: Perl 5のとは異なり、シギルの後にコンマ、セミコロン、識別子が続かないコロンまたはブラケットまたは空白文字（ユニコードブラケットと空白文字を含む）の何か種類が続くならば、punctuationalな変数よりもむしろ名前のないシギルであることはとられる。

source: This allows you to use sigils as coercion operators:
ja: これは、強制演算子としてシギルを使うことができる：

source: In declarative constructs bare sigils may be used as placeholders for anonymous variables:
ja: 叙述的な構成概念において、裸のシギルが、無名変数のためのプレースホールダーとして使われるかもしれない：

source: Outside of declarative constructs you may use * for a placeholder:
ja: 叙述的な構成概念の外で、あなたはプレースホールダーのために*を使うかもしれない：

source: Attempts to say something like:
ja: 以下のような何かを言う試み：

source: will result in the message, &quot;Anonymous variable requires declarator&quot;.
ja: 結果としてメッセージ（「無名変数は、宣言を必要とする」）になる。

source: Package-qualified names
ja: パッケージ-修飾された名前

source: Ordinary package-qualified names look like they do in Perl 5:
ja: それらがPerl 5でするように、普通のパッケージ-修飾された名前は見る：

source: Sometimes it's clearer to keep the sigil with the variable name, so an alternate way to write this is:
ja: 時々、変数名でシギルを保つことはより明白であるので、これを書く交互の方法は以下の通りである：

source: This is resolved at compile time because the variable name is a constant.
ja: 変数名が定数であるので、これはコンパイル時で解決される。

source: Pseudo-packages
ja: 擬似パッケージ

source: The following pseudo-package names are reserved at the front of a name:
ja: 以下の疑似パッケージ名は、名前の先頭に確保される：

source: The following relative names are also reserved but may be used anywhere in a name:
ja: 以下の関係名が確保されもするが、名前でどこでも使われるかもしれない：

source: Other all-caps names are semi-reserved.
ja: 他のオールキャプス名は、半確保される。

source: We may add more of them in the future, so you can protect yourself from future collisions by using mixed case on your top-level packages.
ja: 我々は将来それらのより多くを加えるかもしれないので、あなたはトップレベルのパッケージで入り混じったケースを用いて将来の衝突から身を守ることができる。

source: (We promise not to break any existing top-level CPAN package, of course.
ja: （我々は、もちろん、何か既存のトップレベルのCPANパッケージをあけないと約束する。

source: Except maybe ACME, and then only for coyotes.)
ja: 多分ACME以外はだろう、そして、コヨーテのためにだけ。）

source: The file's scope is known as UNIT, but there are one or more lexical scopes outside of that corresponding to the linguistic setting (often known as the prelude in other cultures).
ja: ファイルのスコープはUNITとして知られている、しかし、一つ以上のレキシカルスコープが言語セッティング（しばしば他の文化の序曲として知られる）と一致してそれの外にある。

source: Hence, the SETTING scope is equivalent to UNIT::OUTER.
ja: それゆえに、｛セッティング｝スコープは、UNIT::OUTERに等しい。

source: For a standard Perl program SETTING is the same as CORE, but various startup options (such as -n or -p) can put you into a domain specific language, in which case CORE remains the scope of the standard language, while SETTING represents the scope defining the DSL that functions as the setting of the current file.
ja: 標準のために、PerlプログラムSETTINGはCOREと同じである、しかし、いろいろな最初のオプション（例えば-nまたは-p）はあなたを領域特定言語に翻訳することができる、その場合には、SETTINGが現行ファイルをセットすることとして機能するDSLを定義しているスコープを表現する間、COREは標準言語のスコープのままである。

source: See also the -L/--language switch described in S19.
ja: S19で記述される-L/--languageスイッチ参照。

source: If a setting wishes to gain control of the main execution, it merely needs to declare a MAIN routine as documented in S06.
ja: セッティングが主要な処刑の利得制御に望むならば、S06で文書化されるように、それは単にMAINを日常的であると宣言する必要があるだけである。

source: In this case the ordinary execution of the user's code is suppressed;
ja: この場合、ユーザーのコードの普通の実行は、抑えられる;

source: instead, execution of the user's code is entirely delegated to the setting's MAIN routine, which calls back to the user's lexically embedded code with YOU_ARE_HERE.
ja: その代わりに、ユーザーのコードの実行はセッティングのMAINルーチンにまったく委任される。そして、それはYOU_ARE_HEREでユーザーの辞書的に埋め込みコードにかけ直す。

source: The YOU_ARE_HERE functions within the setting as a proxy for the user's UNIT block, so -n and -p may be implemented in a setting with:
ja: YOU_ARE_HEREはユーザーのUNITブロックの代用として舞台の中で機能するので、-nと-pはセッティングで以下で実装されるかもしれない：

source: and the user may use loop control phasers as if they were directly in the loop block.
ja: そして、まるでそれらが直接ループブロックにあるように、ユーザーはループ制御フェイザー銃を使うかもしれない。

source: Any OUTER in the user's code refers to the block outside of YOU_ARE_HERE.
ja: ユーザーのコードの何かOUTERは、YOU_ARE_HEREの外でブロックに言及する。

source: If used as a standalone statement, YOU_ARE_HERE runs as if it were a bare block.
ja: 独立型文として使われるならば、まるでそれが裸のブロックであるように、YOU_ARE_HEREは走る。

source: Note that, since the UNIT of an EVAL is the evaluated string itself, the SETTING of an EVAL is the language in effect at the point of the EVAL, not the language in effect at the top of the file.
ja: なお、EVALのUNITが評価された文字列そのものである時から、EVALのSETTINGはEVAL（ファイルの最上位で活動中の言語でない）の間際に活動中の言語である。

source: (You may, however, use OUTER::SETTING to get the setting of the code that is executing the EVAL.) In more traditional terms, the normal program is functioning as the &quot;prelude&quot; of the EVAL.
ja: より伝統的な項に（しかし、あなたはEVALを実行しているコードのセッティングを得るためにOUTER::SETTINGを使うかもしれない。）、通常のプログラムは、EVALの序曲として機能している。

source: So the outermost lexical scopes nest like this, traversed via OUTER:
ja: それで、最も外部のレキシカルスコープはこのように入れ子にする。そして、OUTERを通して横断される：

source: The outermost package scopes nest like this, traversed via PARENT:
ja: 最も外部のパッケージスコープはこのように入れ子にする。そして、PARENTを通して横断される：

source: Your main program starts up in the GLOBAL package and the UNIT lexical scope.
ja: あなたの主プログラムは、GLOBALパッケージとUNITレキシカルスコープを始める。

source: Whenever anything is declared with &quot;our&quot; semantics, it inserts a name into both the current package and the current lexical scope.
ja: 何でも「我々」の意味論で宣言されるときはいつでも、それは名前をカレントパッケージと現在のレキシカルスコープに挿入する。

source: (And &quot;my&quot; semantics only insert into the current lexical scope.) Note that the standard setting, CORE, is a lexical scope, not a package;
ja: なお、標準的なセッティング（CORE）は、レキシカルスコープ（パッケージでない）である（そして、「私」のセマンティックは、レキシカルスコープを流れに挿入するだけである。）;

source: the various items that are defined within (or imported into) CORE are *not* in GLOBAL, which is pretty much empty when your program starts compiling, and mostly only contains things you either put there yourself, or some other module put there because you used that module.
ja: COREの中で（または重要だった）定義されるいろいろなアイテムはGLOBALの*not*である。そして、あなたのプログラムが編集し始めるとき、それはほとんど空で、あなたがそのモジュールを使用したので大部分はあなたも自分でそこに置いた、または、若干の他のモジュールがそこに置いたものを含むだけである。

source: In general things defined within (or imported into) CORE should only be declared or imported with &quot;my&quot; semantics.
ja: 一般に、（または、重要だった）COREの中で定義されるものは、私の意味論で宣言されなければならないだけであるか、輸入されなければならないだけである。

source: All Perl code can see CORE anyway as the outermost lexical scope, so there's no need to also put such things into GLOBAL.
ja: すべてのPerlコードは少なくともCOREを最も外部のレキシカルスコープとみなすことができるので、また、そのようなものをGLOBALに入れる必要がない。

source: The GLOBAL package itself is accessible via UNIT::GLOBAL.
ja: GLOBALパッケージそのものは、UNIT::GLOBALを通して利用できる。

source: The PROCESS package is accessible via UNIT::PROCESS.
ja: PROCESSパッケージは、UNIT::PROCESSを通して利用できる。

source: The PROCESS package is not the parent of GLOBAL.
ja: PROCESSパッケージは、GLOBALの親でない。

source: However, searching up the dynamic stack for dynamic variables will look in all nested dynamic scopes (mapped automatically to each call's lexical scope, not package scope) out to the main dynamic scope;
ja: しかし、動的変数のためにダイナミックなスタックの上で捜すことは、外へすべての入れ子になった動的スコープ（自動的に各々の呼び出しのレキシカルスコープ（パッケージスコープでない）にマップされる）を、主な動的スコープにのぞく;

source: once all the dynamic scopes are exhausted, it also looks in the GLOBAL package and then in the PROCESS package, so $*OUT typically finds the process's standard output handle.
ja: すべての動的スコープが使い果たされたら、それもGLOBALパッケージで、そして、PROCESSパッケージでのぞくので、$*OUTはプロセスの標準出力ハンドルを概して見つける。

source: Hence, PROCESS and GLOBAL serve as extra outer dynamic scopes, much like CORE and SETTING function as extra outer lexical scopes.
ja: それゆえに、PROCESSとGLOBALは、余分の外の動的スコープ（非常に余分の外のレキシカルスコープとしてのCOREとSETTING関数のような）として用いられる。

source: Extra SETTING scopes keep their identity and their nesting within CORE, so you may have to go to OUTER several times from UNIT before you get to CORE.
ja: 余分のSETTINGスコープは彼らのアイデンティティと彼らが入れ子にすることをCOREの中で保つので、COREに着く前に、あなたはUNITから数回OUTERへ行かなければならないかもしれない。

source: Normally, however, there is only the core setting, in which case UNIT::OUTER ends up meaning the same as SETTING which is the same as CORE.
ja: しかし、通常、中心的なセッティングだけがある、その場合には、UNIT::OUTERは結局COREと同じであるSETTINGと同じことを意味することになる。

source: Extra GLOBAL scopes are treated differently.
ja: 余分のGLOBALスコープは、違って扱われる。

source: Every compilation unit has its own associated UNIT::GLOBAL package.
ja: すべてのコンパイル単位には、それ自身の関連したUNIT::GLOBALパッケージがある。

source: As the currently compiling compilation unit expresses the need for various other compilation units, the global names known to those other units must be merged into the new unit's UNIT::GLOBAL.
ja: 現在編集しているコンパイル単位がいろいろな他のコンパイル単位の必要を表して、それらの他の単位に知られているグローバル名は新しい単位のUNIT::GLOBALに合併されなければならない。

source: (This includes the names in all the packages within the global package.) If two different units use the same global name, they must generally be taken to refer to the same item, but only if the type signatures can be meshed (and augmentation rules followed, in the case of package names).
ja: 2つの異なる単位が同じグローバル名を使用するならば、しかし、型シグネチャがかみ合うことができる（そして、パッケージ名の場合、増加規則はあとに続いた）場合だけ、それらは同じアイテムに言及するために通常、とられなければならない（これは世界的なパッケージの範囲内で名前をすべてのパッケージに含む。）。

source: If two units provide package names with incompatible type signatures, the compilation of the unit fails.
ja: 2つの単位がパッケージ名に非互換の型シグネチャを提供するならば、単位の編集は失敗する。

source: In other words, you may not use incompatible global types to provide a union type.
ja: 言い換えると、共用体型を提供するために、非互換の世界的な型を使わなくてもよい。

source: However, if one or the other unit underspecifies the type in a compatible way, the underspecified type just takes on the extra type information as it learns it. (Presumably some combination of Liskov substitution, duck-typing, and run-time checking will prevent tragedy in the unit that was compiled with the underspecified type.
ja: しかし、どちらか一方の単位が互換性を持つ方法で型をunderspecifiesするならば、それがそれを学んで、underspecifiedされた型はちょうど余分の情報を引き受ける。（おそらく、Liskov代用の若干の組合せ、カモ-タイピングとチェックしている実行時は、underspecifiedされた型で編集された単位で、悲劇を防止する。

source: Alternately, the compiler is allowed to recompile or re-examine the unit with the new type constraints to see if any issues are certain to arise at run time, in which case the compiler is free to complain.)
ja: あるいは、コンパイラは何か問題が実行時で起こることは確かかどうか見るために新しい型制約で単位を再コンパイルするか、再検査するのを許可される、その場合には、コンパイラは不満を言うことができる。）

source: Any dynamic variable declared with our in the user's main program (specifically, the part compiled with GLOBAL as the current package) is accessible (by virtue of being in GLOBAL) as a dynamic variable even if not directly in the dynamic call chain.
ja: たとえダイナミックな呼び出しチェーンで直接ないとしても、動的変数がユーザーの主プログラム（とりわけ、カレントパッケージとしてGLOBALで編集される部分）でourで宣言した何でも動的変数としてアクセスできる（GLOBALであることによって）。

source: Note that dynamic vars do *not* look in CORE for anything. (They might look in SETTING if you're running under a setting distinct from CORE, if that setting defines a dynamic scope outside your main program, such as for the -n or -p switch.) Context variables declared with our in the GLOBAL or PROCESS packages do not need to use the * twigil, since the twigil is stripped before searching those packages.
ja: ダイナミックなバールがどうあってもCOREで*not*観察をすることに注意すべきである。twigilがそれらのパッケージを捜す前にむかれる時から、GLOBALでourで宣言される前後関係変数またはPROCESSパッケージは* twigilを使う必要はない（そのセッティングがあなたの主プログラムの外で動的スコープを定義する（例えば-nまたは-pスイッチについては）ならば、あなたがCOREとは別のセッティングの下に走っているならば、それらはSETTINGをのぞくかもしれない。）。

source: Hence, your environment variables are effectively declared without the sigil:
ja: それゆえに、あなたの環境変数は、シギルなしで効果的に宣言される：

source: Interpolating into names
ja: 名前への補間

source: You may interpolate a string into a package or variable name using ::($expr) where you'd ordinarily put a package or variable name.
ja: あなたは、通常パッケージまたは変数名を置くだろう::($expr)を使っているパッケージまたは変数名に文字列を改変するかもしれない。

source: The string is allowed to contain additional instances of ::, which will be interpreted as package nesting.
ja: 文字列は::の更なるインスタンスを含ませておかれる。そして、それは入れ子にしているパッケージと解釈される。

source: You may only interpolate entire names, since the construct starts with ::, and either ends immediately or is continued with another :: outside the parens.
ja: 構成概念が::から始めて、すぐに終わるか、括弧の外でもう一つの::で続けられる時から、あなたは全名前を差し込むだけかもしれない。

source: Most symbolic references are done with this notation:
ja: 大部分の記号参照は、この表記法でされる：

source: Note that unlike in Perl 5, initial :: doesn't imply global.
ja: Perl 5のとは異なり、最初の::が全世界に含蓄しない点に注意しなさい。

source: Here as part of the interpolation syntax it doesn't even imply package.
ja: ここでは展開構文の一部として、それはパッケージさえ意味しない。

source: After the interpolation of the ::() component, the indirect name is looked up exactly as if it had been there in the original source code, with priority given first to leading pseudo-package names, then to names in the lexical scope (searching scopes outwards, ending at CORE).
ja: ::()構成要素の展開の後、正確にまるでそれがそれからレキシカルスコープ（外へスコープを捜して、COREのところで終わる）に名前に、最初に主要な疑似パッケージ名にプライオリティーを与えて、元のソースコードでそこにあったように、間接的な名前は調べられる。

source: The current package is searched last.
ja: カレントパッケージは、最後に捜される。

source: Use the MY pseudopackage to limit the lookup to the current lexical scope, and OUR to limit the scopes to the current package scope.
ja: 検索を現在のレキシカルスコープに制限するMY擬似パッケージとスコープをカレントパッケージスコープに制限するOURを使いなさい。

source: Strict lookup
ja: 厳しい検索

source: When &quot;strict&quot; is in effect (which is the default except for one-liners), non-qualified variables (such as $x and @y) are only looked up from lexical scopes, but never from package scopes.
ja: 「厳しい」ものは活動中である（そしてそれは冗談以外のデフォルトである）とき、資格がない変数（例えば$xと@y）は決してパッケージスコープからでなく、レキシカルスコープから調べられるだけである。

source: To bind package variables into a lexical scope, simply say our ($x, @y).
ja: レキシカルスコープにパッケージ変数を結びつけるために、単にour ($x, @y)を言いなさい。

source: To bind global variables into a lexical scope, predeclare them with use:
ja: レキシカルスコープ（predeclareにuseによるそれら）にグローバル変数を結びつけること：

source: Or just refer to them as $*IN and $*OUT.
ja: または、ちょうどそれらを$*INと$*OUTと称しなさい。

source: Direct lookup
ja: 直接ルックアップ

source: To do direct lookup in a package's symbol table without scanning, treat the package name as a hash:
ja: ウイルスチェックなしでパッケージのシンボルテーブルで直接ルックアップをして、パッケージ名をハッシュとみなすこと：

source: The :: before the subscript is required here, because the Foo::Bar... syntax is reserved for attaching a &quot;WHENCE&quot; initialization closure to an autovivifiable type object.
ja: 添え字の前の::は、ここで必要とされる、Foo::Bar...構文が付属するために予約の、autovivifiableな型への初期化クロージャが、反対する。

source: (see S12).
ja: （S12を見る）。

source: Unlike ::() symbolic references, this does not parse the argument for ::, nor does it initiate a namespace scan from that initial point.
ja: ::()記号参照と違って、これは::のために引数を解析しないし、それはその始点から名前空間走査を始めない。

source: In addition, for constant subscripts, it is guaranteed to resolve the symbol at compile time.
ja: そのうえ、固定添え字のために、コンパイル時でシンボルを解決することは、保証される。

source: The null pseudo-package is reserved to mean the same search list as an ordinary name search.
ja: 無効な擬似パッケージは、普通の名前検索と同じ検索リストを意味するために確保される。

source: That is, the following are all identical in meaning:
ja: つまり、以下のすべては、意味で同一である：

source: That is, each of them scans lexical scopes outward, and then the current package scope (though the package scope is then disallowed when &quot;strict&quot; is in effect).
ja: つまり、それらの各々は、外へレキシカルスコープ、そして、カレントパッケージスコープ（「厳しい」ものは活動中であるときそれからパッケージスコープが認められないけれども）を探査する。

source: As a result of these rules, you can write any arbitrary variable name as either of:
ja: これらの規則の結果、あなたは以下のどちらとしてでも、何にでも任意の変数名を書くことができる：

source: You can also use the ::&lt;&gt; form as long as there are no spaces in the name.
ja: スペースが名前でない限り、あなたは::&lt;&gt;の形を使用することもできる。

source: Symbol tables
ja: シンボルテーブル

source: The current lexical symbol table is now accessible through the pseudo-package MY.
ja: 現在の語彙的なシンボルテーブルは、現在擬似パッケージMYを通してアクセスできる。

source: The current package symbol table is visible as pseudo-package OUR.
ja: カレントパッケージシンボルテーブルは、擬似パッケージOURとして見える。

source: The OUTER name refers to the MY symbol table immediately surrounding the current MY, and OUTER::OUTER is the one surrounding that one.
ja: OUTER名はすぐに現在のMYを囲んでいるMYシンボルテーブルを指す、そして、OUTER::OUTERはあれを囲んでいるものである。

source: You may not use any lexically scoped symbol table, either by name or by reference, to add symbols to a lexical scope that is done compiling.
ja: シンボルを編集することをされるレキシカルスコープに加えるために、名前で、または、参照によって、少しも辞書的に捜し出されたシンボルテーブルを使用しなくてもよい。

source: (We reserve the right to relax this if it turns out to be useful though.)
ja: （それがしかし役に立つことがわかるならば、我々はこれをリラックスさせる権利を保有する。）

source: Dynamic lookup
ja: ダイナミックな検索

source: The CALLER package refers to the lexical scope of the (dynamically scoped) caller.
ja: CALLERパッケージは、（ダイナミックに捜し出される）発信者のレキシカルスコープに言及する。

source: The caller's lexical scope is allowed to hide any user-defined variable from you.
ja: 発信者のレキシカルスコープは、何か利用者変数をあなたから隠させておかれる。

source: In fact, that's the default, and a lexical variable must have the trait &quot;is dynamic&quot; to be visible via CALLER.
ja: 実際、それはデフォルトである、そして、静的変数はCALLERを通して見えるトレイト&quot;is dynamic&quot;を持たなければならない。

source: ($_, $! and $/ are always dynamic, as are any variables whose declared names contain a * twigil.) If the variable is not visible in the caller, it returns Failure.
ja: 変数が発信者で見えないならば、それはFailureを返る（$_、$!と$/は常にダイナミックである。そして、そのことは宣言された名前が* twigilを含む何か変数である。）。

source: Variables whose names are visible at the point of the call but that come from outside that lexical scope are controlled by the scope in which they were originally declared as dynamic.
ja: 名前が呼び出しの際に見える、しかし、そのレキシカルスコープの外でから来る変数は、ダイナミックであるように、それらが当初宣言されたスコープによってコントロールされる。

source: Hence the visibility of CALLER::&lt;$*foo&gt; is determined where $*foo is actually declared, not by the caller's scope (unless that's where it happens to be declared).
ja: それゆえに、$*fooが実は宣言される所で、CALLER::&lt;$*foo&gt;の可視性は決定される、発信者のスコープ（それがそれが偶然宣言されることが起こるところでない限り）によってでなく。

source: Likewise CALLER::CALLER::&lt;$x&gt; depends only on the declaration of $x visible in your caller's caller.
ja: 同様に、CALLER::CALLER::&lt;$x&gt;はあなたの発信者の訪問者で見える$xの宣言だけに依存する。

source: User-defined dynamic variables should generally be initialized with ::= unless it is necessary for variable to be modified.
ja: 変数が修正されることが必要でない限り、ユーザー定義の動的変数は通常、::=で初期化されなければならない。
